#ifndef __TIM_H__
#define __TIM_H__

/*************************************************
*实验名：定时器实验
*实验效果：第一个led灯以定时器0设定的时间周期闪烁
*************************************************/

sbit led = P1^0;

void timer0_init()
{
	TMOD = 0x01; //定时器0选择工作方式1
    TH0 = 0x00;	 //设置初始值
    TL0 = 0x00; 
    EA = 1;			 //打开总中断
    ET0 = 1;		 //打开定时器0中断
    TR0 = 1;		 //启动定时器0
}

void tim_1()
{
	led = 1;
	timer0_init();
	while(1);
}

void timer0() interrupt 1
{
    TH0 = 0x00;	 //设置初始值
    TL0 = 0x00; 
	led = ~led;
}

/*************************************************
*实验名：定时器实验
*实验效果：第一个led灯以500ms一次的精确频率闪烁
*************************************************/


int i = 0;

void timer1_init()
{
	TMOD = 0x20; //定时器0选择工作方式1
    TH1 = 0x24;	 //设置初始值，定时50ms
    TL1 = 0x24; 
    EA = 1;			 //打开总中断
    ET1 = 1;		 //打开定时器0中断
    TR1 = 1;		 //启动定时器0
}

void tim_2()
{
	led = 1;
	timer1_init();//定时器1的初始化
	while(1)
	{
		if(i==5000)
		{
		  led = ~led;
		  i = 0; //注意i需要零
		}
	}


}

void timer1() interrupt 3
{
//    TH1 = 0x4C;	 //设置初始值，定时50ms
//    TL1 = 0x00;
	i++;
}

#endif